**free
//
// TESTGET - Simple FTP GET Example (Free-Format Version)
//
// Copyright (c) 2001-2025 Scott C. Klement
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
// 1. Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ''AS IS'' AND
// ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
// FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
// OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
// HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
// LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
// OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
// SUCH DAMAGE.
//

///
/// This is a simple example of using the FTPAPI to download a file
/// from ftp.freebsd.org.
///
/// Steps:
///   1) Connect to the server
///   2) Switch to the pub/FreeBSD directory
///   3) Download README.TXT in binary mode
///   4) Log out
///

ctl-opt dftactgrp(*no) actgrp(*new) bnddir('FTPAPI');
ctl-opt option(*srcstmt: *nodebugio);

/copy FTPAPI_H

// Variables
dcl-s ftp int(10);
dcl-s msg char(52);

// ============================================================================
// Main Program Logic
// ============================================================================

// Connect to FTP server
// Using userid: anonymous
// Password: anon.e.mouse@aol.com
ftp = ftp_conn('ftp2.freebsd.org'
             : 'anonymous'
             : 'anon.e.mouse@aol.com');

// Check for connection errors
if ftp < 0;
  msg = ftp_errorMsg(0);
  dsply msg;
  *inlr = *on;
  return;
endif;

// Change to the FreeBSD directory on this FTP server
// Deal with any errors
if ftp_chdir(ftp: 'pub/FreeBSD') < 0;
  msg = ftp_errorMsg(ftp);
  dsply msg;
  ftp_quit(ftp);
  *inlr = *on;
  return;
endif;

// Get the README.TXT file and save it to the /tmp directory locally
ftp_binaryMode(ftp: *on);

if ftp_get(ftp: 'README.TXT': '/tmp/README.TXT') < 0;
  msg = ftp_errorMsg(ftp);
  dsply msg;
  ftp_quit(ftp);
  *inlr = *on;
  return;
endif;

// The transfer was successful
ftp_quit(ftp);
msg = 'Success!';
dsply msg;
*inlr = *on;