**free
//
// TESTURL - FTP URL Download Example (Free-Format Version)
//
// Copyright (c) 2001-2025 Scott C. Klement
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
// 1. Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ''AS IS'' AND
// ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
// FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
// DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
// OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
// HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
// LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
// OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
// SUCH DAMAGE.
//

///
/// This is a simple example of using the FTPAPI to download a file
/// from ftp.freebsd.org by URL.
///
/// This demonstrates the FTP_url_get() function which allows you to
/// download a file using a complete FTP URL instead of connecting
/// and navigating manually.
///

ctl-opt dftactgrp(*no) actgrp(*new) bnddir('FTPAPI');
ctl-opt option(*srcstmt: *nodebugio);

/copy FTPAPI_H

// Variables
dcl-s msg char(52);
dcl-s url varchar(256);
dcl-s myfile varchar(256);

// ============================================================================
// Main Program Logic
// ============================================================================

// Set the URL to download
url = 'ftp://ftp2.freebsd.org/pub/FreeBSD/tools/fips.exe';

// Set the local file path
myfile = '/tmp/fips.exe';

// Download the file using URL
if ftp_url_get(url: myfile) < 0;
  msg = ftp_errorMsg(0);
else;
  msg = 'Success!';
endif;

dsply msg;
*inlr = *on;